[{"author":"dpug","text":"They are brachycephalic – Here is a new word for you to learn. It just basically means that the head is broad but short which results in the smushed face appearance that pugs are well known for.","createdAt":1466222045,"id":"e07bdb06-f44b-492f-8ef7-77596ff54dd8","imageURL":"http://www.funnyjunksite.com/pictures/wp-content/uploads/2013/09/Funny-Pug.jpg"},{"author":"DPUG","text":"Pugs are celebrities – well not really, but there are a ton of celebrities that have pugs of their own. Just a few examples include Jessica Alba, Gerard Butler, Robin Williams, Kid Rock, Brix Smith, Dave Ramsey, Hugh Laurie and even Queen Victoria. There are a lot more examples, too many to list in fact.","createdAt":1466264070,"id":"17b23989-6010-443d-ae8f-03b7064dcb6f","imageURL":"http://fullhdpictures.com/wp-content/uploads/2016/01/Smiling-Pug-Wallpaper.jpg"},{"author":"fpug","text":"They are the official dog of the House of Orange – After a heroic Pug called Pompey saved the life of a prince, the breed became the dog of choice by the House of Orange-Nassau dynasty.","createdAt":1466222022,"id":"5a910cc2-e44f-44a5-ab5f-9a99a0b2802c","imageURL":"https://s-media-cache-ak0.pinimg.com/736x/76/b3/88/76b38880a3a32ad233422c7922d1f7d4.jpg"},{"author":"PUGGY","text":"Pugs have starred in several movies – Well I guess this really does make them celebrities then. These little guys made into films such as “The Adventures of Milo and Otis”, “Men in Black”, “Pocahontas”, “Hotel for Dogs” and many others.","createdAt":1466265024,"id":"a7c6eb57-a2cf-4d1d-8292-c1259d06cee8","imageURL":"http://image.shutterstock.com/z/stock-photo-little-fat-pug-sitting-on-sidewalk-in-summer-park-206851003.jpg"},{"author":"zpug","text":"Pug average running speed is around 3-5mph – These guys are just not that quick unfortunately and they get tired easily. So if you’re looking for a dog that you can take on your morning jogs, this breed is probably not for you.","createdAt":1466263486,"id":"71d6ae61-25a2-413d-8dff-158023e8c7ea","imageURL":"http://meanmugpug.com/img/IMG_9832.jpg"}]